/***************************************************************************
 *  标题 ： 临界区锁实现文件。
 *  功能描述 ： 临界区资源冲突
 *  创建日期 ： 2008/03/31
 *  版本号 ： ver1.00.00
 *  作者  ： 吕立国
 *  修改历史及原因
 *  Date                  Note                 Reason            Updator
 *
 ***************************************************************************/

#include "StdAfx.h"
#include "CriticalLock.h"

/********************************************************************
 *	名称:CriticalLock
 *	功能描述:构造函数,初始化临界区
 *	参数:
 *		输入参数:
 *		无
 *		输出参数:
 *		无
 *	日期:2008-3-31
 *	作者:吕立国
 *********************************************************************/
CriticalLock::CriticalLock()
{
	::InitializeCriticalSection(&m_section);
}

/********************************************************************
 *	名称:~CriticalLock
 *	功能描述:析构函数,删除临界区
 *	参数:
 *		输入参数:
 *		无
 *		输出参数:
 *		无
 *	日期:2008-3-31
 *	作者:吕立国
 *********************************************************************/
CriticalLock::~CriticalLock()
{
	::DeleteCriticalSection(&m_section);
}

/********************************************************************
 *	名称:Lock
 *	功能描述:加锁
 *	参数:
 *		输入参数:
 *		无
 *		输出参数:
 *		无
 *	日期:2008-3-31
 *	作者:吕立国
 *********************************************************************/
void CriticalLock::Lock()
{
	EnterCriticalSection(&m_section);
}

/********************************************************************
 *	名称:UnLock
 *	功能描述:解锁
 *	参数:
 *		输入参数:
 *		无
 *		输出参数:
 *		无
 *	日期:2008-3-31
 *	作者:吕立国
 *********************************************************************/
void CriticalLock::UnLock()
{
	LeaveCriticalSection(&m_section);
}
